Show / Hide Table of Contents
Class RebarStirrups
Represents a rebar grouping in 3D space.
Inheritance
System.Object
OpenObject
OpenElementId
RebarBase
RebarStirrups
Inherited Members
 RebarBase.Material
 RebarBase.Diameter
 RebarBase.RebarShape
 RebarBase.RebarParentElement
 RebarBase.RebarAllocationElement
 RebarBase.GroupId
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RebarStirrups,CI.StructuralElements", "CI.StructModel.Structure.IRebarStirrups,CI.BasicTypes")]
public class RebarStirrups : RebarBase
Constructors
Improve this Doc   View Source
RebarStirrups()
create a new instance.
Declaration
public RebarStirrups()
Properties
Improve this Doc   View Source
Patterns
Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
Declaration
public List<RebarStirrupPattern> Patterns { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<RebarStirrupPattern>
 Improve this Doc
 View Source